___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

# Aggregation & Groupby

The ``groupby`` method allows you to group rows of data together and call aggregate functions

### Basic aggregation methods:

* ``count()``
* ``mean()``
* ``median()``
* ``min()``
* ``max()``
* ``std()``
* ``var()``
* ``sum()``

In [280]:
import seaborn as sns
import pandas as pd
import numpy as np

 - # ``df.groupby()``

In [286]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [287]:
df['method'].value_counts()

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [292]:
df.groupby("method")[["distance"]].mean()

                                  distance
method
Astrometry                       17.875000
Eclipse Timing Variations       315.360000
Imaging                          67.715937
Microlensing                   4144.000000
Orbital Brightness Modulation  1180.000000
Pulsar Timing                  1200.000000
Pulsation Timing Variations            NaN
Radial Velocity                  51.600208
Transit                         599.298080
Transit Timing Variations      1104.333333

In [293]:
df.columns

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

In [294]:
df.groupby('method')[['distance']].sum()

                                distance
method
Astrometry                         35.75
Eclipse Timing Variations        1261.44
Imaging                          2166.91
Microlensing                    41440.00
Orbital Brightness Modulation    2360.00
Pulsar Timing                    1200.00
Pulsation Timing Variations         0.00
Radial Velocity                 27348.11
Transit                        134242.77
Transit Timing Variations        3313.00

In [295]:
df.year.unique()

array([2006, 2008, 2011, 2007, 2009, 2002, 1996, 2010, 2001, 1995, 2004,
       2012, 2013, 2005, 2000, 2003, 1997, 1999, 2014, 1998, 1989, 1992,
       1994], dtype=int64)

In [296]:
df.groupby('year')['mass'].count()

year
1989     1
1992     0
1994     0
1995     1
1996     4
1997     1
1998     5
1999    14
2000    14
2001    11
2002    31
2003    22
2004    15
2005    34
2006    20
2007    32
2008    43
2009    74
2010    41
2011    91
2012    24
2013    30
2014     5
Name: mass, dtype: int64

 - # ``DataFrame`` Operations

**Map / Replace**

In [319]:
data = {'Company':['GOOGLE', 'GOOGLE', 'MICROSOFT', 'MICROSOFT', 'FACE', 'FACE'],
       'Person':['PB', 'Chandler', 'Ross', 'Joey', 'Rachel', 'Monica'],
       'Sales':[100, 140, 150, 99, 102, 110]}

In [320]:
df4=pd.DataFrame(data)

In [321]:
df4

     Company    Person  Sales
0     GOOGLE        PB    100
1     GOOGLE  Chandler    140
2  MICROSOFT      Ross    150
3  MICROSOFT      Joey     99
4       FACE    Rachel    102
5       FACE    Monica    110

In [323]:
my_map={'GOOGLE':'GOO','MICROSOFT':'MIC','FACE':'FB'}

In [324]:
df_m=df4.copy()

In [325]:
df_m.Company=df_m.Company.map(my_map)

In [326]:
df_m

  Company    Person  Sales
0     GOO        PB    100
1     GOO  Chandler    140
2     MIC      Ross    150
3     MIC      Joey     99
4      FB    Rachel    102
5      FB    Monica    110

In [327]:
df_m['Sales']=df_m.Sales.map(lambda x: x*1000)
df_m

  Company    Person   Sales
0     GOO        PB  100000
1     GOO  Chandler  140000
2     MIC      Ross  150000
3     MIC      Joey   99000
4      FB    Rachel  102000
5      FB    Monica  110000

In [328]:
df_m['Company'].replace(to_replace='GOO',value='Google')

0    Google
1    Google
2       MIC
3       MIC
4        FB
5        FB
Name: Company, dtype: object

**Duplicate**

In [333]:
dup_df = pd.DataFrame([5,5,6,7,8,8,7],['a','b','c','d','e','f','g'])
dup_df

   0
a  5
b  5
c  6
d  7
e  8
f  8
g  7

In [334]:
dup_df.drop_duplicates()

   0
a  5
c  6
d  7
e  8

- ### `.aggregate()`
- ### `.filter()`
- ### `.transform()`
- ### `.apply()`
- ### `.pivot_table()`

In [347]:
df6 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,20,30,50,52,100],
                   'var2': [100,200,300,500,500,700]})
df6

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

### ``.aggregate()``

In [348]:
df6.groupby('groups').mean()

        var1  var2
groups
A         30   300
B         36   350
C         65   500

In [349]:
df6.groupby('groups').aggregate([np.min,np.median,np.max])

       var1             var2
       amin median amax amin median amax
groups
A        10     30   50  100    300  500
B        20     36   52  200    350  500
C        30     65  100  300    500  700

In [350]:
df6.groupby('groups').agg([min,'median',max])

       var1             var2
        min median  max  min median  max
groups
A        10     30   50  100    300  500
B        20     36   52  200    350  500
C        30     65  100  300    500  700

In [351]:
df6.groupby('groups').agg({'var1':('min','max') , 'var2':'median'})

       var1        var2
        min  max median
groups
A        10   50    300
B        20   52    350
C        30  100    500

### ``.filter()``

In [368]:
df7 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,20,30,50,52,100],
                   'var2': [100,200,300,500,500,700]})
df7

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

In [369]:
df7.groups.unique()

array(['A', 'B', 'C'], dtype=object)

In [370]:
df7.groupby("groups").std()

             var1        var2
groups
A       28.284271  282.842712
B       22.627417  212.132034
C       49.497475  282.842712

In [377]:
def filter_func(x):
    return x["var1"].mean() < 36

In [378]:
df7.groupby("groups").mean()

        var1  var2
groups
A         30   300
B         36   350
C         65   500

In [379]:
# returns the rows that meet the condition, as a DataFrame
df7.groupby('groups').filter(filter_func)

  groups  var1  var2
0      A    10   100
3      A    50   500

In [380]:
df7.groupby("groups").sum()

        var1  var2
groups
A         60   600
B         72   700
C        130  1000

In [382]:
df7.groupby('groups').filter(lambda x : x['var2'].sum()<800)

  groups  var1  var2
0      A    10   100
1      B    20   200
3      A    50   500
4      B    52   500

### ``.transform()``

In [398]:
df8 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,20,30,50,52,100],
                   'var2': [100,200,300,500,500,700]})
df8

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

In [399]:
df8.groupby('groups').transform('mean')

   var1  var2
0    30   300
1    36   350
2    65   500
3    30   300
4    36   350
5    65   500

In [401]:
df8.groupby('groups').transform(np.log)

       var1      var2
0  2.302585  4.605170
1  2.995732  5.298317
2  3.401197  5.703782
3  3.912023  6.214608
4  3.951244  6.214608
5  4.605170  6.551080

In [406]:
df8.var1.transform(np.exp)

0    2.202647e+04
1    4.851652e+08
2    1.068647e+13
3    5.184706e+21
4    3.831008e+22
5    2.688117e+43
Name: var1, dtype: float64

### ``.apply()``

In [408]:
df9 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,20,30,50,52,100],
                   'var2': [100,200,300,500,500,700]})
df9

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

In [409]:
df9.apply(np.sum)

groups    ABCABC
var1         262
var2        2300
dtype: object

In [410]:
df9.var1.sum()

262

In [412]:
df_numeric = df9.iloc[:,1:3]

In [413]:
df_numeric

   var1  var2
0    10   100
1    20   200
2    30   300
3    50   500
4    52   500
5   100   700

In [415]:
df_numeric.apply(np.mean, axis=1)

0     55.0
1    110.0
2    165.0
3    275.0
4    276.0
5    400.0
dtype: float64

In [416]:
df9.groupby('groups').apply(np.mean)

        var1   var2
groups
A       30.0  300.0
B       36.0  350.0
C       65.0  500.0

### `df.transform() vs df.apply()`

In [29]:
df10 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz'],
                    'col4':['AbC','dh','Dh','ASD']})
df10

   col1  col2 col3 col4
0     1   444  abc  AbC
1     2   555  def   dh
2     3   666  ghi   Dh
3     4   444  xyz  ASD

In [30]:
df10["col4"].transform(len)

0    3
1    2
2    2
3    3
Name: col4, dtype: int64

In [35]:
#returns the length of each variable (columns) separately
df10.col4.apply(len)

0    3
1    2
2    2
3    3
Name: col4, dtype: int64

In [425]:
df1 = pd.DataFrame([["a", 9, 25]] * 4, columns=["grp", 'P', 'Q'])
df2 = pd.DataFrame([["b", 9, 25]] * 3, columns=["grp", 'P', 'Q'])
df3 = pd.concat([df1, df2], ignore_index=True)
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [428]:
# returns a DataFrame that does not have the same length as itself
df3.groupby("grp").apply(sum)

      grp   P    Q
grp
a    aaaa  36  100
b     bbb  27   75

In [429]:
df3.groupby("grp").transform(sum)

    P    Q
0  36  100
1  36  100
2  36  100
3  36  100
4  27   75
5  27   75
6  27   75

# merge

In [1]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Arthur', 'Michael', 'Jason', 'David', 'Thomas'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})

right = pd.DataFrame({
    'id':[1,2,3,4,6],
   'Name': ['Mehmet', 'Terry', 'Joseph', 'Matt', 'Bruce'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})

In [3]:
left

   id     Name subject_id
0   1   Arthur       sub1
1   2  Michael       sub2
2   3    Jason       sub4
3   4    David       sub6
4   5   Thomas       sub5

In [4]:
right

   id    Name subject_id
0   1  Mehmet       sub2
1   2   Terry       sub4
2   3  Joseph       sub3
3   4    Matt       sub6
4   6   Bruce       sub5

In [2]:
pd.merge(left, right, how = 'inner', on = 'id')

   id   Name_x subject_id_x  Name_y subject_id_y
0   1   Arthur         sub1  Mehmet         sub2
1   2  Michael         sub2   Terry         sub4
2   3    Jason         sub4  Joseph         sub3
3   4    David         sub6    Matt         sub6

In [6]:
pd.merge(left, right, how = 'outer', on = 'id')

   id   Name_x subject_id_x  Name_y subject_id_y
0   1   Arthur         sub1  Mehmet         sub2
1   2  Michael         sub2   Terry         sub4
2   3    Jason         sub4  Joseph         sub3
3   4    David         sub6    Matt         sub6
4   5   Thomas         sub5     NaN          NaN
5   6      NaN          NaN   Bruce         sub5

In [7]:
pd.merge(left, right, how = 'left', on = 'id')

   id   Name_x subject_id_x  Name_y subject_id_y
0   1   Arthur         sub1  Mehmet         sub2
1   2  Michael         sub2   Terry         sub4
2   3    Jason         sub4  Joseph         sub3
3   4    David         sub6    Matt         sub6
4   5   Thomas         sub5     NaN          NaN

In [8]:
pd.merge(left, right, how = 'right', on = 'id')

   id   Name_x subject_id_x  Name_y subject_id_y
0   1   Arthur         sub1  Mehmet         sub2
1   2  Michael         sub2   Terry         sub4
2   3    Jason         sub4  Joseph         sub3
3   4    David         sub6    Matt         sub6
4   6      NaN          NaN   Bruce         sub5

In [9]:
pd.merge(left, right, on = ['id', 'subject_id'])

   id Name_x subject_id Name_y
0   4  David       sub6   Matt

In [10]:
pd.merge(left, right, how='outer', on=['id', 'subject_id'])

   id   Name_x subject_id  Name_y
0   1   Arthur       sub1     NaN
1   2  Michael       sub2     NaN
2   3    Jason       sub4     NaN
3   4    David       sub6    Matt
4   5   Thomas       sub5     NaN
5   1      NaN       sub2  Mehmet
6   2      NaN       sub4   Terry
7   3      NaN       sub3  Joseph
8   6      NaN       sub5   Bruce

In [11]:
pd.merge(left, right, how = 'right', on=['id', 'subject_id'])

   id Name_x subject_id  Name_y
0   1    NaN       sub2  Mehmet
1   2    NaN       sub4   Terry
2   3    NaN       sub3  Joseph
3   4  David       sub6    Matt
4   6    NaN       sub5   Bruce

In [12]:
pd.merge(left, right, how = 'left', on=['id', 'subject_id'])

   id   Name_x subject_id Name_y
0   1   Arthur       sub1    NaN
1   2  Michael       sub2    NaN
2   3    Jason       sub4    NaN
3   4    David       sub6   Matt
4   5   Thomas       sub5    NaN

# join

In [13]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index = ['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index = ['K0', 'K2', 'K3'])

In [14]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [15]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [16]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [17]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [18]:
left.join(right, how = "inner")

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [19]:
left.join(right, how = "right")

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

### Pivot Tables

In [37]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [38]:
titanic.groupby(["sex","class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [39]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### Using pivot table

- Create a spreadsheet-style pivot table as a ``DataFrame``.

In [40]:
titanic.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [43]:
#multiple aggregation function
titanic.pivot_table('survived',index='sex',columns='class',aggfunc=['mean','sum'])

            mean                       sum
class      First    Second     Third First Second Third
sex
female  0.968085  0.921053  0.500000    91     70    72
male    0.368852  0.157407  0.135447    45     17    47

In [41]:
data = {'A':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
       'B':['one', 'one', 'two', 'two', 'one', 'one'],
       'C':['x', 'y', 'x', 'y', 'x', 'y'],
       'D':[1, 3, 2, 5, 4, 1]}

df5 = pd.DataFrame(data)

df5

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [42]:
df5.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN